package lesson08.tasks_08_01;

/*
Задача №1
Написать статический метод, превращающий натуральное (целое положительное) число
(например, 643) в строку, состоящую из названий цифр этого числа (например, “шесть
четыре три”).
 */
public class ATaskRunner {
    public static void main(String[] args) {
        System.out.println(Task_08_01.numberToString(6437890));
    }
}